{
  "books": [
    {
      "id": 1,
      "author": "David Flanagan",
      "price": 10.99,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@javascript_the_definitive_guide.jpg",
      "title": "JavaScript: The Definitive Guide, 7th Edition",
      "level": "Beginner",
      "tags": ["core", "frontend", "javascript"],
      "amount": 42,
      "shortDescription": "JavaScript is the programming language of the web and is used by more software developers today than any other programming language.",
      "description": "JavaScript is the programming language of the web and is used by more software developers today than any other programming language. For nearly 25 years this best seller has been the go-to guide for JavaScript programmers. The seventh edition is fully updated to cover the 2020 version of JavaScript, and new chapters cover classes, modules, iterators, generators, Promises, async/await, and metaprogramming. You’ll find illuminating and engaging example code throughout. This book is for programmers who want to learn JavaScript and for web developers who want to take their understanding and mastery to the next level. It begins by explaining the JavaScript language itself, in detail, from the bottom up. It then builds on that foundation to cover the web platform and Node.js."
    },
    {
      "id": 2,
      "author": "James Padolsey",
      "price": 31.99,
      "image": "",
      "title": "Clean Code in JavaScript",
      "level": "Middle",
      "tags": ["core", "frontend", "javascript"],
      "amount": 42,
      "shortDescription": "Building robust apps starts with creating clean code. In this book, you'll explore techniques for doing this by learning everything from the basics of JavaScript through to the practices of clean code. You'll write functional, intuitive, and maintainable code while also understanding how your code affects the end user and the wider community.",
      "description": "Building robust apps starts with creating clean code. In this book, you'll explore techniques for doing this by learning everything from the basics of JavaScript through to the practices of clean code. You'll write functional, intuitive, and maintainable code while also understanding how your code affects the end user and the wider community. The book starts with popular clean-coding principles such as SOLID, and the Law of Demeter (LoD), along with highlighting the enemies of writing clean code such as cargo culting and over-management. You'll then delve into JavaScript, understanding the more complex aspects of the language. Next, you'll create meaningful abstractions using design patterns, such as the Class Pattern and the Revealing Module Pattern. You'll explore real-world challenges such as DOM reconciliation, state management, dependency management, and security, both within browser and server environments. Later, you'll cover tooling and testing methodologies and the importance of documenting code. Finally, the book will focus on advocacy and good communication for improving code cleanliness within teams or workplaces, along with covering a case study for clean coding. By the end of this book, you'll be well-versed with JavaScript and have learned how to create clean abstractions, test them, and communicate about them via documentation."
    },
    {
      "id": 3,
      "author": "Adam D. Scott",
      "price": 8.99,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@javascript_everywhere.jpg",
      "title": "JavaScript Everywhere",
      "level": "Beginner",
      "tags": ["core", "frontend", "javascript"],
      "amount": 42,
      "shortDescription": "JavaScript is the little scripting language that could. Once used chiefly to add interactivity to web browser windows, JavaScript is now a primary building block of powerful and robust applications.",
      "description": "JavaScript is the little scripting language that could. Once used chiefly to add interactivity to web browser windows, JavaScript is now a primary building block of powerful and robust applications. In this practical book, new and experienced JavaScript developers will learn how to use this language to create APIs as well as web, mobile, and desktop applications. Author and engineering leader Adam D. Scott covers technologies such as Node.js, GraphQL, React, React Native, and Electron. Ideal for developers who want to build full stack applications and ambitious web development beginners looking to bootstrap a startup, this book shows you how to create a single CRUD-style application that will work across several platforms."
    },
    {
      "id": 4,
      "author": "Alex Banks, Eve Porcello",
      "price": 18.99,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@learning_react_2nd_edition.jpg",
      "title": "Learning React, 2nd Edition",
      "level": "Beginner",
      "tags": ["core", "frontend", "javascript", "react"],
      "amount": 42,
      "shortDescription": "If you want to learn how to build efficient React applications, this is your book.",
      "description": "If you want to learn how to build efficient React applications, this is your book. Ideal for web developers and software engineers who understand how JavaScript, CSS, and HTML work in the browser, this updated edition provides best practices and patterns for writing modern React code. No prior knowledge of React or functional JavaScript is necessary. With their learning road map, authors Alex Banks and Eve Porcello show you how to create UIs that can deftly display changes without page reloads on large-scale, data-driven websites. You’ll also discover how to work with functional programming and the latest ECMAScript features. Once you learn how to build React components with this hands-on guide, you’ll understand just how useful React can be in your organization."
    },
    {
      "id": 5,
      "author": "Stoyan Stefanov",
      "price": 14.99,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@react_up_and_running_2nd_edition.jpg",
      "title": "React: Up & Running, 2nd Edition",
      "level": "Middle",
      "tags": ["core", "frontend", "javascript", "react"],
      "amount": 42,
      "shortDescription": "Hit the ground running with React, the open source technology from Facebook for building rich web applications fast.",
      "description": "Hit the ground running with React, the open source technology from Facebook for building rich web applications fast. Updated for the latest React release, the second edition of this hands-on guide shows you how to build React components and organize them into maintainable large-scale apps. If you're familiar with JavaScript syntax, you're ready to get started. Through the course of this book, author Stoyan Stefanov helps web developers and programmers build a complete single-page application. You'll quickly learn why some developers consider React the key to the web app development puzzle."
    },
    {
      "id": 6,
      "author": "Eric Meyer, Estelle Weyl",
      "price": 15.99,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@css_the_definitive_guide_5th_edition.jpg",
      "title": "CSS: The Definitive Guide, 5th Edition",
      "level": "Middle",
      "tags": ["core", "frontend", "css"],
      "amount": 42,
      "shortDescription": "If you're a web designer or app developer interested in sophisticated page styling, improved accessibility, and less time and effort expended, this book is for you.",
      "description": "If you're a web designer or app developer interested in sophisticated page styling, improved accessibility, and less time and effort expended, this book is for you. This revised fifth edition provides a comprehensive guide to CSS implementation along with a thorough review of the latest CSS specifications. Authors Eric Meyer and Estelle Weyl show you how to improve user experience, speed development, avoid potential bugs, and add life and depth to your applications through layout, transitions and animations, borders, backgrounds, text properties, and many other tools and techniques."
    },
    {
      "id": 7,
      "author": "Saleem Siddiqui",
      "price": 36.99,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@learning_test_driven_development.jpg",
      "title": "Learning Test-Driven Development",
      "level": "Middle",
      "tags": ["core", "frontend", "javascript", "testing"],
      "amount": 42,
      "shortDescription": "Your code is a testament to your skills as a developer. No matter what language you use, code should be clean, elegant, and uncluttered.",
      "description": "Your code is a testament to your skills as a developer. No matter what language you use, code should be clean, elegant, and uncluttered. By using test-driven development (TDD), you'll write code that's easy to understand, retains its elegance, and works for months, even years, to come. With this indispensable guide, you'll learn how to use TDD with three different languages: Go, JavaScript, and Python. Author Saleem Siddiqui shows you how to tackle domain complexity using a unit test-driven approach. TDD partitions requirements into small, implementable features, enabling you to solve problems irrespective of the languages and frameworks you use. With Learning Test-Driven Development at your side, you'll learn how to incorporate TDD into your regular coding practice."
    },
    {
      "id": 8,
      "author": "Shyam Seshadri",
      "price": 29.99,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@angular_up_and_running.jpg",
      "title": "Angular: Up and Running",
      "level": "Beginner",
      "tags": ["core", "frontend", "javascript", "angular"],
      "amount": 42,
      "shortDescription": "This book will demystify Angular as a framework, as well as provide clear instructions and examples on how to get started with writing scalable Angular applications.",
      "description": "This book will demystify Angular as a framework, as well as provide clear instructions and examples on how to get started with writing scalable Angular applications. Angular: Up & Running covers most of the major pieces of Angular, but in a structured manner that is generally used in hands-on training. Each chapter takes one concept, and use examples to cover how it works. Problems to work on (with solutions) at the end of each chapter reinforce the learnings of each chapter and allow readers to really get hands-on with Angular."
    },
    {
      "id": 9,
      "author": "Mike Amundsen, Sam Ruby, Leonard Richardson",
      "price": 12.99,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@restful_web_apis.jpg",
      "title": "RESTful Web APIs",
      "level": "Middle",
      "tags": ["core", "frontend", "javascript"],
      "amount": 42,
      "shortDescription": "The popularity of REST in recent years has led to tremendous growth in almost-RESTful APIs that don’t include many of the architecture’s benefits.",
      "description": "The popularity of REST in recent years has led to tremendous growth in almost-RESTful APIs that don’t include many of the architecture’s benefits. With this practical guide, you’ll learn what it takes to design usable REST APIs that evolve over time. By focusing on solutions that cross a variety of domains, this book shows you how to create powerful and secure applications, using the tools designed for the world’s most successful distributed computing system: the World Wide Web. You’ll explore the concepts behind REST, learn different strategies for creating hypermedia-based APIs, and then put everything together with a step-by-step guide to designing a RESTful Web API."
    },
    {
      "id": 10,
      "author": "Wendy Chisholm, Matt May",
      "price": 6.99,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@universal_design_for_web_applications.jpg",
      "title": "Universal Design for Web Applications",
      "level": "Pro",
      "tags": ["core", "frontend", "ui"],
      "shortDescription": "Universal Design for Web Applications teaches you how to build websites that are more accessible to people with disabilities and explains why doing so is good business.",
      "description": "Universal Design for Web Applications teaches you how to build websites that are more accessible to people with disabilities and explains why doing so is good business. It takes more work up front, but the potential payoff is huge -- especially when mobile users need to access your sites. You'll discover how to use standards-based web technologies -- such as XHTML, CSS, and Ajax, along with video and Flash -- to develop applications for a wide range of users and a variety of devices, including the mobile Web. You'll also learn specifics about this target audience, especially the key over-50 age group, whose use of the Web is rapidly growing."
    },
    {
      "id": 11,
      "author": "Ido Green",
      "price": 14.99,
      "image": "",
      "title": "Web Workers: Multithreaded Programs in JavaScript",
      "level": "Pro",
      "tags": ["core", "frontend", "javascript"],
      "amount": 42,
      "shortDescription": "Web apps would run much better if heavy calculations could be performed in the background, rather than compete with the user interface.",
      "description": "Web apps would run much better if heavy calculations could be performed in the background, rather than compete with the user interface. With this book, you’ll learn how to use Web Workers to run computationally intensive JavaScript code in a thread parallel to the UI. If you have an intermediate to advanced understanding of JavaScript— especially event handling and callbacks—you’re ready to tackle Web Workers with the tools in this example-driven guide."
    },
    {
      "id": 12,
      "author": "Andrew Lombardi",
      "price": 10.89,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@websocket.jpg",
      "title": "WebSocket",
      "level": "Pro",
      "tags": ["core", "frontend", "javascript"],
      "amount": 42,
      "shortDescription": "Until recently, creating desktop-like applications in the browser meant using inefficient Ajax or Comet technologies to communicate with the server.",
      "description": "Until recently, creating desktop-like applications in the browser meant using inefficient Ajax or Comet technologies to communicate with the server. With this practical guide, you’ll learn how to use WebSocket, a protocol that enables the client and server to communicate with each other on a single connection simultaneously. No more asynchronous communication or long polling! For developers with a good grasp of JavaScript (and perhaps Node.js), author Andrew Lombardi provides useful hands-on examples throughout the book to help you get up to speed with the WebSocket API. You’ll also learn how to use WebSocket with Transport Layer Security (TLS)."
    },
    {
      "id": 13,
      "author": "Christopher Wells",
      "price": 14.49,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@securing_ajax_applications.jpg",
      "title": "Securing Ajax Applications",
      "level": "Pro",
      "tags": ["core", "frontend", "javascript", "ajax"],
      "amount": 42,
      "shortDescription": "Ajax applications should be open yet secure. Far too often security is added as an afterthought. Potential flaws need to be identified and addressed right away.",
      "description": "Ajax applications should be open yet secure. Far too often security is added as an afterthought. Potential flaws need to be identified and addressed right away. This book explores Ajax and web application security with an eye for dangerous gaps and offers ways that you can plug them before they become a problem. By making security part of the process from the start, you will learn how to build secure Ajax applications and discover how to respond quickly when attacks occur. Securing Ajax Applications succinctly explains that the same back-and-forth communications that make Ajax so responsive also gives invaders new opportunities to gather data, make creative new requests of your server, and interfere with the communications between you and your customers. This book presents basic security techniques and examines vulnerabilities with JavaScript, XML, JSON, Flash, and other technologies -- vital information that will ultimately save you time and money."
    },
    {
      "id": 14,
      "author": "Prem Kumar Ponuthorai, Jon Loeliger",
      "price": 26.49,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@version_control_with_git_3rd_edition.jpg",
      "title": "Version Control with Git, 3rd Edition",
      "level": "Beginner",
      "tags": ["frontend", "git"],
      "amount": 42,
      "shortDescription": "Track, branch, merge, and manage code revisions with Git, the free and open source distributed version control system.",
      "description": "Track, branch, merge, and manage code revisions with Git, the free and open source distributed version control system. Through a series of step-by-step tutorials, this practical guide quickly takes you from Git fundamentals to advanced techniques, and provides friendly yet rigorous advice for navigating Git's many functions. You'll learn how to work with everything from small to very large projects with speed and efficiency. In this third edition, authors Prem Kumar Ponuthorai and Jon Loeliger break down Git concepts using a modular approach. You'll start with the basics and fundamental philosophy of Git, followed by intermediate commands to help you efficiently supplement your daily development workflow. Finally, you'll learn advanced Git commands and concepts to understand how Git works under the hood."
    },
    {
      "id": 15,
      "author": "Shannon Bradshaw, Eoin Brazil, Kristina Chodorow",
      "price": 29.49,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@mongodb_the_definitive_guide_3rd_edition.jpg",
      "title": "MongoDB: The Definitive Guide, 3rd Edition",
      "level": "Pro",
      "tags": ["db"],
      "amount": 42,
      "shortDescription": "Manage your data with a system designed to support modern application development.",
      "description": "Manage your data with a system designed to support modern application development. Updated for MongoDB 4.2, the third edition of this authoritative and accessible guide shows you the advantages of using document-oriented databases. You’ll learn how this secure, high-performance system enables flexible data models, high availability, and horizontal scalability. Authors Shannon Bradshaw, Eoin Brazil, and Kristina Chodorow provide guidance for database developers, advanced configuration for system administrators, and use cases for a variety of projects. NoSQL newcomers and experienced MongoDB users will find updates on querying, indexing, aggregation, transactions, replica sets, ops management, sharding and data administration, durability, monitoring, and security."
    },
    {
      "id": 16,
      "author": "Anna Skoulikari",
      "price": 6.39,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@learning_git.jpg",
      "title": "Learning Git",
      "level": "Beginner",
      "tags": ["core", "git"],
      "amount": 42,
      "shortDescription": "Learn the basics of Git in a simple, visual, and tangible manner.",
      "description": "Learn the basics of Git in a simple, visual, and tangible manner. With this practical book, author Anna Skoulikari helps you build a mental model of how Git version control works so that you can get the most out of this powerful tool. Whether you're a developer, data professional, technical writer, designer, or product manager, you'll learn the basics of Git in a straightforward and approachable way. Learning Git uses storytelling principles not only to place lessons in a familiar context, but also to make the information more memorable. By introducing information in an incremental manner, this book makes all the content accessible so you don't get bogged down with unknown terms or concepts. This guide is ideal whether you're working on a shared document or managing your own version control project."
    },
    {
      "id": 17,
      "author": "Amelia Bellamy-Royds, Kurt Cagle, Dudley Storey",
      "price": 21.49,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@using_svg_with_css3_and_html5.jpg",
      "title": "Using SVG with CSS3 and HTML5",
      "level": "Beginner",
      "tags": ["core", "css", "html"],
      "amount": 42,
      "shortDescription": "Using Scalable Vector Graphics (SVG) for illustrations only scratches the surface of this format’s potential on the web.",
      "description": "Using Scalable Vector Graphics (SVG) for illustrations only scratches the surface of this format’s potential on the web. With this practical guide, you’ll learn how to use SVG not only for illustrations but also as graphical documents that you can integrate into complex HTML5 web pages, and style with custom CSS. Web developers will discover ways to adapt designs by adding data based graphics, dynamic styles, interaction, or animation."
    },
    {
      "id": 18,
      "author": "Sarah Drasner",
      "price": 28.39,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@svg_animations.jpg",
      "title": "SVG Animations",
      "level": "Middle",
      "tags": ["css"],
      "amount": 42,
      "shortDescription": "SVG is extremely powerful, with its reduced HTTP requests and crispness on any display.",
      "description": "SVG is extremely powerful, with its reduced HTTP requests and crispness on any display. It becomes increasingly more interesting as you explore its capabilities for responsive animation and performance boons. When you animate SVG, you must be aware of normal image traits like composition, color, implementation, and optimization. But when you animate, it increases the complexity of each of these factors exponentially. This practical book takes a deep dive into how you can to solve these problems with stability, performance, and creativity in mind."
    },
    {
      "id": 19,
      "author": "Emma Jane Hogbin Westby",
      "price": 7.39,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@git_for_teams.jpg",
      "title": "Git for Teams",
      "level": "Beginner",
      "tags": ["core", "git"],
      "amount": 42,
      "shortDescription": "You can do more with Git than just build software.",
      "description": "You can do more with Git than just build software. This practical guide delivers a unique people-first approach to version control that also explains how using Git as a focal point can help your team work better together. You’ll learn how to plan and pursue a Git workflow that not only ensures that you accomplish project goals, but also fits the immediate needs and future growth of your team. The first part of the book on structuring workflow is useful for project managers, technical team leads, and CTOs. The second part provides hands-on exercises to help developers gain a better understanding of Git commands."
    },
    {
      "id": 20,
      "author": "Shelley Powers",
      "price": 38.49,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@learning_node_2nd_edition.jpg",
      "title": "Learning Node, 2nd Edition",
      "level": "Middle",
      "tags": ["core", "node"],
      "amount": 42,
      "shortDescription": "Take your web development skills from browser to server with Node—and learn how to write fast, highly scalable network applications on this JavaScript-based platform.",
      "description": "Take your web development skills from browser to server with Node—and learn how to write fast, highly scalable network applications on this JavaScript-based platform. Updated for the latest Node Long Term Support (LTS) and Node Current (6.0) releases, this hands-on edition helps you master Node’s core fundamentals and gain experience with several built-in and contributed modules. Get up to speed on Node’s event-driven, asynchronous I/O model for developing data-intensive applications that are frequently accessed but computationally simple. If you’re comfortable working with JavaScript, this book provides many programming and deployment examples to help you take advantage of server-side development with Node."
    },
    {
      "id": 21,
      "author": "Garann Means",
      "price": 41.89,
      "image": "https://courses.prometheus.org.ua/asset-v1:Ciklum+FEB101+2022_T3+type@asset+block@node_for_front_end_developers.jpg",
      "title": "Node for Front-End Developers",
      "level": "Middle",
      "tags": ["core", "node", "frontend"],
      "amount": 42,
      "shortDescription": "If you know how to use JavaScript in the browser, you already have the skills you need to put JavaScript to work on back-end servers with Node.",
      "description": "If you know how to use JavaScript in the browser, you already have the skills you need to put JavaScript to work on back-end servers with Node. This hands-on book shows you how to use this popular JavaScript platform to create simple server applications, communicate with the client, build dynamic pages, work with data, and tackle other tasks. Although Node has a complete library of developer-contributed modules to automate server-side development, this book will show you how to program with Node on your own, so you truly understand the platform. Discover firsthand how well Node works as a web server, and how easy it is to learn and use."
    }
  ]
}
